# Арифметические операторы
a, b = 12, 5   # задали a = 12, b = 5

print(a + b)   # 12 + 5 = 17 → 17
print(a - b)   # 12 - 5 = 7 → 7
print(a * b)   # 12 * 5 = 60 → 60
print(a / b)   # 12 / 5 = 2.4 → 2.4
print(a % b)   # 12 % 5 = 2 → 2
print(a ** b)  # 12 ** 5 = 248832 → 248832
print(a // b)  # 12 // 5 = 2 → 2

# Операторы сравнения
print(a != b)   # 12 != 5 → True
print(a <= b)   # 12 <= 5 → False

# Логические операторы
print(a > 10 and b < 10)   # (12 > 10) и (5 < 10) → True
print(a < 10 or b < 10)    # (12 < 10) или (5 < 10) → True
print(not(b == 5))         # не(5 == 5) → не(True) → False
